<?php
//◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆
//アクセスアドレス
//http://jyarashi.php.xdomain.jp/GAME_DB/GameDB_Receive_Post.php
//
//USER:jyarashi_game
//PASSWORD:game4game4
//
//◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆

//====================================================
///引数/固定値の設定
//====================================================
//--------------------------------------------------
//引数設定
//--------------------------------------------------
	//引数設定
	if(isset($_POST['game_tytle']))
	{
		$game_tytle = $_POST['game_tytle'];
	}

	if(isset($_POST['user_id']))
	{
		$user_id = $_POST['user_id'];
	}

	if(isset($_POST['message1']))
	{
		$message1 = $_POST['message1'];
	}
	
	if(isset($_POST['message2']))
	{
		$message2 = $_POST['message2'];
	}


//--------------------------------------------------
//DBアクセス設定
//--------------------------------------------------
	//固定値
	$dsn 	= 'mysql:dbname=jyarashi_game; host=mysql1.php.xdomain.ne.jp; charset=utf8';
	$usr 	= 'jyarashi_game';
	$passwd = 'game4game4';

	//PHP呼び出し引数
	$tbl 	= $game_tytle."_".$user_id;


//====================================================
//DB制御
//====================================================
//--------------------------------------------------
//データベースへの接続
//--------------------------------------------------
 	try 
 	{
    	$db = new PDO($dsn, $usr, $passwd);
 	}
 	catch (PDOException $e) 
 	{
		exit("データベースに接続できません。：{$e->getMessage()}");
 	}


//--------------------------------------------------
//テーブル作成
//--------------------------------------------------
	//値の設定
	$sql = 	"CREATE TABLE IF NOT EXISTS ". $tbl
			."("
			. "`id`"			." "			."CHAR(10),"
			. "`date`"			." "			."DATETIME,"
			. "`message1`"		." "			."CHAR(10),"
			. "`message2`"		." "			."CHAR(10)"
			.");";

	//設定を実行する
	$stmt = $db -> prepare($sql);
	$stmt -> execute();


//--------------------------------------------------
//テーブル件数
//--------------------------------------------------
	$sql = 'select count(*) as cnt from '.$tbl;
	$stmt = $db->query($sql);
	$count = $stmt->fetchColumn();


//--------------------------------------------------
//INSERT文を変数に格納
//--------------------------------------------------
	$sql = "INSERT INTO " .$tbl. " ( id, date, message1, message2 ) VALUES ( :id, now(), :message1, :message2 )";


//--------------------------------------------------
//挿入する値は空のまま、SQL実行の準備をする
//--------------------------------------------------
	$stmt = $db->prepare($sql);


//--------------------------------------------------
//挿入する値を配列に格納する
//--------------------------------------------------
	$params = array( ':id' => $user_id, ':message1' =>  $message1, ':message2' => $message2 );


//--------------------------------------------------
//挿入する値が入った変数をexecuteにセットして
//SQL DBを更新する
//--------------------------------------------------
	$stmt->execute($params);


//====================================================
// DBの表示(確認用)
//====================================================
//表示開始
//--------------------------------------------------
	echo 'Start DB Display';
	echo '<br><br>';


//--------------------------------------------------
//更新したテーブル名の表示
//--------------------------------------------------
	echo $tbl;
	echo '<br><br>';


//--------------------------------------------------
// SELECT文を変数に格納
//--------------------------------------------------
	$sql = "SELECT * FROM " .$tbl;


//--------------------------------------------------
// SQLステートメントを実行し、結果を変数に格納
//--------------------------------------------------
	$stmt = $db->query($sql);


//--------------------------------------------------
// foreach文で配列の中身を一行ずつ出力
//--------------------------------------------------
	foreach ($stmt as $row)
	{
		//--------------------------------------------------
  		// データベースのフィールド名で出力
  		//--------------------------------------------------
  		echo $row['id'] . ' ' . $row['date'] . ' ' . $row['message1'] . ' ' . $row['message2'];
  		echo '<br>';
  		
	}


//--------------------------------------------------
//表示終了
//--------------------------------------------------
	echo '<br>';
	echo 'End DB Display';
	echo '<br>';


?>
