<?php
//◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆
//アクセスアドレス
//http://jyarashi.php.xdomain.jp/GAME_DB/test0001_XY_Pos/XYPos_Send_JSON.php
//
//USER:jyarashi_game
//PASSWORD:game4game4
//
//◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆◆

//====================================================
///引数/設定値一覧
//====================================================
//--------------------------------------------------
//引数
//--------------------------------------------------
	//テスト用の一時設定値
	$game_tytle 		= "TestGame3";
	$user_id 			= "TestPlayer3";
	$player_x_pos 		= 5.0;
	$player_y_pos 		= 5.0;


//--------------------------------------------------
//DBアクセス設定値
//--------------------------------------------------
	//ユーザ・パスワード設定
	$dsn 	= 'mysql:dbname=jyarashi_game; host=mysql1.php.xdomain.ne.jp; charset=utf8';
	$usr 	= 'jyarashi_game';
	$passwd = 'game4game4';

	//保存先DB名称
	$tbl 	= $game_tytle."_".$user_id;


//====================================================
//DB制御
//====================================================
//--------------------------------------------------
//データベースへの接続
//--------------------------------------------------
 	try 
 	{
    	$db = new PDO($dsn, $usr, $passwd);
 	}
 	catch (PDOException $e) 
 	{
		exit("データベースに接続できません。：{$e->getMessage()}");
 	}
 	

//--------------------------------------------------
// SELECT文を変数に格納
//--------------------------------------------------
	$sql = "SELECT * FROM " .$tbl;

//--------------------------------------------------
// SQLステートメントを実行し、結果を変数に格納
//--------------------------------------------------
	$stmt = $db->query($sql);


//--------------------------------------------------
// foreach文で配列の中身を一行ずつ出力
//--------------------------------------------------
	foreach ($stmt as $row)
	{
  		//=============================
		//送信データ作成
		//=============================
		$data = array
				(
    				"id" 			=> 	$row['id'],
    				"date" 			=>	$row['date'],
    				"player_x_pos" 	=> 	$row['player_x_pos'],
    				"player_y_pos" 	=>	$row['player_y_pos']
				);
  		
  		//echo $row['id'] . ' ' . $row['date'] . ' ' . $row['player_x_pos'] . ' ' . $row['player_y_pos'];
  		//echo '<br>';
  		
	}





//=============================
//JSONデータへのパース
//=============================
takes_array("data",$data);




//=============================
//Function：JSONデータへのパース
//=============================
function takes_array($array_name, $array_data)
{
 //配列をJSON形式に変換
 echo "{". $array_name. ":[". json_encode($array_data). "]}";

}





?>
